/* Spanish (Español) versions of kiki texts */
/* translation by jay_traveller */
 
/* game title */

"kiki the nano bot" = "kiki el nanobot";

/* menu */

"new game" = "juego nuevo";
"load level" = "cargar nivel";
"next level" = "siguiente nivel";
"restart" = "reiniciar";
"setup" = "configuracion";
"story" = "historia";
"demo" = "demo";
"about" = "informacion";
"help" = "ayda";
"quit" = "cerrar";
"back" = "atras";

/* about */

"version" = "version";
"programmed by" = "programacion";
"sounds from" = "sonido";
"thanks to" = "agradecimientos";
"visit" = "visita";
"for more games" = "mas juegos";
"main menu" = "menu principal";

/* story */

"STORY_PAGE_1" = "habia una vez,\nunos\npequeños robots\nviviendo en el nanomundo.\n\nvivian una feliz vida artificial\nrecolectando recursos activamente\npara su creador\nquien hizo mas y mas\npequeños robots.";

"STORY_PAGE_2" = "pero un dia,\nun parasito\ndestruyo el programa principal\nde control del creador.\n\ndesde entonces\nel solo produce\ninservibles, flojos y pequeños\nrobots estupidos\nquienes se atacan entre si\ny destruyeron el nanomundo.";

"STORY_PAGE_3" = "tu tarea es ayudar a kiki,\nel ultimo robot,\na reparar a su creador.\n\nbuena suerte!";

/* setup */

"off" = "desactivado";
"on" = "activado";
"sound" = "sonido";
"volume" = "volumen";
"fullscreen" = "pantalla completa";
"fov" = "fov";
"speed" = "velocidad";
"keyboard setup" = "configuracion de teclado";
"save" = "guardar";

/* keyboard setup */

"$no_itemkeyboard setup" = "$no_itemconfiguracion de teclado"; // don't translate $no_item
"$no_item" = "$no_item"; // don't change this

"move forward" = "adelante";
"move backward" = "atras";
"turn left" = "izquierda";
"turn right" = "derecha";
"jump" = "salto";
"push" = "empujar";
"shoot" = "disparo";
"change view" = "cambiar vista";
"look up" = "mirar arriba";
"look down" = "mirar abajo";
    
"press the new key" = "presiona la nueva tecla";
"action without key" = "accion sin tecla";
"back to setup" = "regresar a configuracion";

/* help */

"HELP_SPIKES_1" = "$scale(1.5)mission:\nllega a la salida!\n\nevita los picos!\ncamina sobre ellos,\nsolo si estan retraidos";

"HELP_GOLD_1" = "$scale(1.5)mission:\nllega a la salida!\n\npara poder salir,\nmueve las rocas\n\npara mover una roca,\npresiona \"$key(push)\"+\"$key(move forward)\"";

"HELP_JUMP_1" = "$scale(1.5)mission:\nllega a la salida!\n\npara poder salir,\nsalta sobre los cubos\n\npara saltar,\npresiona \"$key(jump)\"";

"HELP_JUMP_2" = "para saltar al frente,\npresiona \"$key(jump)\"+\"$key(move forward)\"\n\npuedes girar\nmientras saltas!\n\npara girar,\npresiona \"$key(turn left)\"\o \"$key(turn right)\"";

